leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxIom_regdef.h
/** \brief  IOM Event Combiner Module Event Trigger History Register 0 */
typedef struct _Ifx_IOM_ECMETH0_Bits
{
    unsigned int ETA0:1;                    /**< \brief [0:0] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA1:1;                    /**< \brief [1:1] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA2:1;                    /**< \brief [2:2] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA3:1;                    /**< \brief [3:3] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA4:1;                    /**< \brief [4:4] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA5:1;                    /**< \brief [5:5] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA6:1;                    /**< \brief [6:6] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA7:1;                    /**< \brief [7:7] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA8:1;                    /**< \brief [8:8] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA9:1;                    /**< \brief [9:9] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA10:1;                   /**< \brief [10:10] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA11:1;                   /**< \brief [11:11] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA12:1;                   /**< \brief [12:12] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA13:1;                   /**< \brief [13:13] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA14:1;                   /**< \brief [14:14] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETA15:1;                   /**< \brief [15:15] LAM 0-15 Event Trigger Activity (last) (rwh) */
    unsigned int ETB0:1;                    /**< \brief [16:16] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB1:1;                    /**< \brief [17:17] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB2:1;                    /**< \brief [18:18] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB3:1;                    /**< \brief [19:19] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB4:1;                    /**< \brief [20:20] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB5:1;                    /**< \brief [21:21] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB6:1;                    /**< \brief [22:22] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB7:1;                    /**< \brief [23:23] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB8:1;                    /**< \brief [24:24] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB9:1;                    /**< \brief [25:25] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB10:1;                   /**< \brief [26:26] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB11:1;                   /**< \brief [27:27] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB12:1;                   /**< \brief [28:28] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB13:1;                   /**< \brief [29:29] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB14:1;                   /**< \brief [30:30] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
    unsigned int ETB15:1;                   /**< \brief [31:31] LAM 0-15 Event Trigger Activity (previous ETA0-15) (rwh) */
} Ifx_IOM_ECMETH0_Bits;

/** \brief  IOM Event Combiner Module Event Trigger History Register 1 */
typedef struct _Ifx_IOM_ECMETH1_Bits
{
    unsigned int ETC0:1;                    /**< \brief [0:0] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC1:1;                    /**< \brief [1:1] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC2:1;                    /**< \brief [2:2] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC3:1;                    /**< \brief [3:3] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC4:1;                    /**< \brief [4:4] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC5:1;                    /**< \brief [5:5] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC6:1;                    /**< \brief [6:6] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC7:1;                    /**< \brief [7:7] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC8:1;                    /**< \brief [8:8] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC9:1;                    /**< \brief [9:9] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC10:1;                   /**< \brief [10:10] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC11:1;                   /**< \brief [11:11] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC12:1;                   /**< \brief [12:12] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC13:1;                   /**< \brief [13:13] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC14:1;                   /**< \brief [14:14] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETC15:1;                   /**< \brief [15:15] LAM 0-15 Event Trigger Activity (previous ETB0-15) (rwh) */
    unsigned int ETD0:1;                    /**< \brief [16:16] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD1:1;                    /**< \brief [17:17] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD2:1;                    /**< \brief [18:18] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD3:1;                    /**< \brief [19:19] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD4:1;                    /**< \brief [20:20] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD5:1;                    /**< \brief [21:21] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD6:1;                    /**< \brief [22:22] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD7:1;                    /**< \brief [23:23] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD8:1;                    /**< \brief [24:24] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD9:1;                    /**< \brief [25:25] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD10:1;                   /**< \brief [26:26] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD11:1;                   /**< \brief [27:27] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD12:1;                   /**< \brief [28:28] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD13:1;                   /**< \brief [29:29] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD14:1;                   /**< \brief [30:30] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
    unsigned int ETD15:1;                   /**< \brief [31:31] LAM 0-15 Event Trigger Activity (previous ETC0-15) (rwh) */
} Ifx_IOM_ECMETH1_Bits;

/** \brief  IOM Event Combiner Module Global Event Selection Register */
typedef struct _Ifx_IOM_ECMSELR_Bits
{
    unsigned int CES0:1;                    /**< \brief [0:0] Event Combiner Selection (rw) */
    unsigned int CES1:1;                    /**< \brief [1:1] Event Combiner Selection (rw) */
    unsigned int CES2:1;                    /**< \brief [2:2] Event Combiner Selection (rw) */
    unsigned int CES3:1;                    /**< \brief [3:3] Event Combiner Selection (rw) */
    unsigned int CES4:1;                    /**< \brief [4:4] Event Combiner Selection (rw) */
    unsigned int CES5:1;                    /**< \brief [5:5] Event Combiner Selection (rw) */
    unsigned int CES6:1;                    /**< \brief [6:6] Event Combiner Selection (rw) */
    unsigned int CES7:1;                    /**< \brief [7:7] Event Combiner Selection (rw) */
    unsigned int CES8:1;                    /**< \brief [8:8] Event Combiner Selection (rw) */
    unsigned int CES9:1;                    /**< \brief [9:9] Event Combiner Selection (rw) */
    unsigned int CES10:1;                   /**< \brief [10:10] Event Combiner Selection (rw) */
    unsigned int CES11:1;                   /**< \brief [11:11] Event Combiner Selection (rw) */
    unsigned int CES12:1;                   /**< \brief [12:12] Event Combiner Selection (rw) */
    unsigned int CES13:1;                   /**< \brief [13:13] Event Combiner Selection (rw) */
    unsigned int CES14:1;                   /**< \brief [14:14] Event Combiner Selection (rw) */
    unsigned int CES15:1;                   /**< \brief [15:15] Event Combiner Selection (rw) */
    unsigned int CTS0:1;                    /**< \brief [16:16] Accumulated (Counted) Event Combiner Selection (rw) */
    unsigned int CTS1:1;                    /**< \brief [17:17] Accumulated (Counted) Event Combiner Selection (rw) */
    unsigned int CTS2:1;                    /**< \brief [18:18] Accumulated (Counted) Event Combiner Selection (rw) */
    unsigned int CTS3:1;                    /**< \brief [19:19] Accumulated (Counted) Event Combiner Selection (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_IOM_ECMSELR_Bits;

/** \brief  IOM Filter and Prescaler Cell Control Register */
typedef struct _Ifx_IOM_FPCCTR_Bits
{
    unsigned int CMP:16;                    /**< \brief [15:0] Threshold Value of Filter & Prescaler Cell k (rw) */
    unsigned int MOD:3;                     /**< \brief [18:16] Operation Mode Selection for Filter & Prescaler Cell k (rw) */
    unsigned int ISM:2;                     /**< \brief [20:19] Monitor Input Signal Selection for Filter & Prescaler Cell k (rw) */
    unsigned int reserved_21:1;             /**< \brief \internal Reserved */
    unsigned int RTG:1;                     /**< \brief [22:22] Reset Timer behaviour for Filter & Prescaler Cell k on Glitch (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int ISR:3;                     /**< \brief [26:24] Reference Input Signal Selection for Filter & Prescaler Cell k (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_IOM_FPCCTR_Bits;

/** \brief  IOM Filter and Prescaler Cells Rising & Falling Edge Status Register */
typedef struct _Ifx_IOM_FPCESR_Bits
{
    unsigned int FEG0:1;                    /**< \brief [0:0] Falling Edge Glitch Flag for FPC0 (rwh) */
    unsigned int FEG1:1;                    /**< \brief [1:1] Falling Edge Glitch Flag for FPC1 (rwh) */
    unsigned int FEG2:1;                    /**< \brief [2:2] Falling Edge Glitch Flag for FPC2 (rwh) */
    unsigned int FEG3:1;                    /**< \brief [3:3] Falling Edge Glitch Flag for FPC3 (rwh) */
    unsigned int FEG4:1;                    /**< \brief [4:4] Falling Edge Glitch Flag for FPC4 (rwh) */
    unsigned int FEG5:1;                    /**< \brief [5:5] Falling Edge Glitch Flag for FPC5 (rwh) */
    unsigned int FEG6:1;                    /**< \brief [6:6] Falling Edge Glitch Flag for FPC6 (rwh) */
    unsigned int FEG7:1;                    /**< \brief [7:7] Falling Edge Glitch Flag for FPC7 (rwh) */
    unsigned int FEG8:1;                    /**< \brief [8:8] Falling Edge Glitch Flag for FPC8 (rwh) */
    unsigned int FEG9:1;                    /**< \brief [9:9] Falling Edge Glitch Flag for FPC9 (rwh) */
    unsigned int FEG10:1;                   /**< \brief [10:10] Falling Edge Glitch Flag for FPC10 (rwh) */
    unsigned int FEG11:1;                   /**< \brief [11:11] Falling Edge Glitch Flag for FPC11 (rwh) */
    unsigned int FEG12:1;                   /**< \brief [12:12] Falling Edge Glitch Flag for FPC12 (rwh) */
    unsigned int FEG13:1;                   /**< \brief [13:13] Falling Edge Glitch Flag for FPC13 (rwh) */
    unsigned int FEG14:1;                   /**< \brief [14:14] Falling Edge Glitch Flag for FPC14 (rwh) */
    unsigned int FEG15:1;                   /**< \brief [15:15] Falling Edge Glitch Flag for FPC15 (rwh) */
    unsigned int REG0:1;                    /**< \brief [16:16] Rising Edge Glitch Flag for FPC0 (rwh) */
    unsigned int REG1:1;                    /**< \brief [17:17] Rising Edge Glitch Flag for FPC1 (rwh) */
    unsigned int REG2:1;                    /**< \brief [18:18] Rising Edge Glitch Flag for FPC2 (rwh) */
    unsigned int REG3:1;                    /**< \brief [19:19] Rising Edge Glitch Flag for FPC3 (rwh) */
    unsigned int REG4:1;                    /**< \brief [20:20] Rising Edge Glitch Flag for FPC4 (rwh) */
    unsigned int REG5:1;                    /**< \brief [21:21] Rising Edge Glitch Flag for FPC5 (rwh) */
    unsigned int REG6:1;                    /**< \brief [22:22] Rising Edge Glitch Flag for FPC6 (rwh) */
    unsigned int REG7:1;                    /**< \brief [23:23] Rising Edge Glitch Flag for FPC7 (rwh) */
    unsigned int REG8:1;                    /**< \brief [24:24] Rising Edge Glitch Flag for FPC8 (rwh) */
    unsigned int REG9:1;                    /**< \brief [25:25] Rising Edge Glitch Flag for FPC9 (rwh) */
    unsigned int REG10:1;                   /**< \brief [26:26] Rising Edge Glitch Flag for FPC10 (rwh) */
    unsigned int REG11:1;                   /**< \brief [27:27] Rising Edge Glitch Flag for FPC11 (rwh) */
    unsigned int REG12:1;                   /**< \brief [28:28] Rising Edge Glitch Flag for FPC12 (rwh) */
    unsigned int REG13:1;                   /**< \brief [29:29] Rising Edge Glitch Flag for FPC13 (rwh) */
    unsigned int REG14:1;                   /**< \brief [30:30] Rising Edge Glitch Flag for FPC14 (rwh) */
    unsigned int REG15:1;                   /**< \brief [31:31] Rising Edge Glitch Flag for FPC15 (rwh) */
} Ifx_IOM_FPCESR_Bits;

/** \brief  IOM Filter and Prescaler Cell Timer Register */
typedef struct _Ifx_IOM_FPCTIM_Bits
{
    unsigned int TIM:16;                    /**< \brief [15:0] Timer Value of Filter and Prescaler Cell k (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_IOM_FPCTIM_Bits;

/** \brief  IOM GTM Input EXOR Combiner Selection Register */
typedef struct _Ifx_IOM_GTMEXR_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] GTM input 0 selection for EXOR combiner (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] GTM input 1 selection for EXOR combiner (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] GTM input 2 selection for EXOR combiner (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] GTM input 3 selection for EXOR combiner (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] GTM input 4 selection for EXOR combiner (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] GTM input 5 selection for EXOR combiner (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] GTM input 6 selection for EXOR combiner (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] GTM input 7 selection for EXOR combiner (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_IOM_GTMEXR_Bits;

